CSI API ETABS v1

# cSapModelPierLabel Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cPierLabel PierLabel { get; }

    ReadOnly Property PierLabel As cPierLabel
    	Get

    Dim instance As cSapModel
    Dim value As cPierLabel

    value = instance.PierLabel

    property cPierLabel^ PierLabel {
    	cPierLabel^ get ();
    }

    abstract PierLabel : cPierLabel with get

#### Property Value

Type: cPierLabel

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com